package lesson9.questions;

/**
 * Вопросы:
 * 1. Какая основная разница между String, StringBuffer и StringBuilder?
 *
 * 2. Что такое конкатенация строк?
 *
 * 3. Как перевернуть строку?
 *
 * 4. Как сравнить значение двух строк?
 *
 * 5. Как обрезать пробелы в начале и конце строки?
 *
 * 6. Что такое пул строк?
 *
 * 7. Можно ли синхронизировать доступ к строке?
 *
 * 8. Как правильно сравнить значения строк String и StringBuffer?
 *
 * @author Kamila Meshcheryakova
 * created 02.08.2020
 */
public class Questions {
}
