package module02.lesson8_associations;

/**
 * Класс Description
 * 1. Понятие наследования.
 *  наследование (inheritance) — механизм, который позволяет описать новый класс на основе существующего (родительского).
 * При этом свойства и функциональность родительского класса заимствуются новым классом.
 * Наследование описывает связь «является» (или по-английски «IS A»). Лев является Животным.

 * 2. Понятие композиция и агрегация.
 * Другой тип отношения: не «является», а «является частью» («HAS A»).
 *
 * Композиция представляет собой такой тип связи, когда одно не может существовать без другого или принадлежать
 * сразу нескольким объектам.
 *
 * Агрегация - когда одно может как принадлежать другому, так и принадлежать третьему, а может и вовсе существовать без
 * этого объекта.
 *
 * Разница между ними заключается в «строгости» этих связей.
 * Класс целого содержит поля (или свойства) своих составных частей.
 *
 * 3. Показать в коде (AggregationComposition).
 *
 * 4. Вопросы к собеседованию:
 * - Какими бывают отношения между классами?
 * - В чем разница между композицией и агрегацией?
 * - Какие вид взаимоотношений описывают классы Студент и Факультатив?
 *
 * 5. Бонус - Регулярки.
 * Показать Check regEx в идее.
 *
 * @author Kamila Meshcheryakova
 * created 29.08.2020
 */
public class Description {
}
