package module04.lesson45_behavioral_patterns;

/**
 * Поведенческие паттерны
 * 1. Определение паттерна.
 * Шаблон проектирования, или паттерн, в разработке программного обеспечения — повторяемая архитектурная конструкция,
 * представляющая собой решение проблемы проектирования, в рамках некоторого часто возникающего контекста.
 *
 * 2. Поведенческие паттерны
 * Поведенческие паттерны — шаблоны проектирования, определяющие алгоритмы и способы реализации взаимодействия
 * различных объектов и классов.
 *
 * Список поведенческих шаблонов проектирования:
 - стратегия (Strategy);
 - итератор (Iterator);
 - наблюдатель (Observer);
 - хранитель (Memento);
 - команда (Command);
 - интерпретатор (Interpreter);
 - посредник (Mediator);
 - состояние (State);
 - шаблонный метод (Template method);
 - посетитель (Visitor);
 - цепочка ответственности (Chain of responsibility).
 *
 * 3. Command
 *
 * Команда - это поведенческий паттерн, позволяющий заворачивать запросы или простые операции в отдельные объекты.
 *
 * Это позволяет откладывать выполнение команд, выстраивать их в очереди, а также хранить историю и делать отмену.
 * Мы инкапсулируе действие от получателя.
 *
 * 4. Interpreter
 *
 *
 * Пример из жизни:
 *
 * 5. Mediator
 *
 *
 * Пример из жизни:
 *
 *
 * 6. State

 *
 * Пример из жизни:
 *

 *
 * @author Kamila Meshcheryakova
 * created 01.11.2020
 */
public class Description {
}
